# IsLinked Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ImportInstance..::..IsLinked Property
ImportInstance Class See Also
---
Identifies whether this instance is a linked object rather than imported one.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool IsLinked { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsLinked As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsLinked {
	bool get ();
}
```

# Remarks
True if the instance was imported as a link to an external file. False if the instance was imported as a copy of data from an external file.
# See Also
ImportInstance Class
Autodesk.Revit.DB Namespace